[
  {
    "id": "8/4/2025 16:45:03",
    "mentor": {
      "name": "Haris Smajlović",
      "organization": "BIDS department @ Yale School of Medicine",
      "bio": "Haris is a Postdoctoral Associate at the Hoon Cho Lab at the BIDS department of Yale School of Medicine. Previously, he was a Ph.D. student at the 0xTCG lab at the University of Victoria, Canada, under the supervision of prof. Ibrahim Numanagić. Before that, he was a lecturer at the Department of Mathematics of the University of Sarajevo and a lead software engineer at Symphony.is. He graduated from the Faculty of Mathematics and Natural Sciences of the University of Sarajevo, under the supervision of prof. Adis Alihodžić.\nHe is interested in privacy-enhancing technologies, programming languages, and securing biomedical workflows.",
      "email": "haris.smajlovic@yale.edu",
      "photo": "https://drive.google.com/file/d/1fwm7T4CZOrW5RZERY6kXvbyrjct9Nr1J/view?usp=sharing"
    },
    "project": {
      "title": "Secure Deep Learning Framework",
      "description": "https://drive.google.com/open?id=1ksbMqtU45kdJALNX0nTY6DpUKkDTJzag",
      "researchArea": "Privacy-enhancing technologies, Programming Languages, Deep Learning",
      "prerequisites": "Good proficiency in Python and basic understanding of neural networks (e.g. loss and activation functions, optimizers, and training mechanisms).",
      "hoursPerWeek": "4"
    },
    "questions": [
      "Please provide a critique of the following paper: https://genomebiology.biomedcentral.com/articles/10.1186/s13059-022-02841-5",
      "... or the following paper (pick one): https://www.usenix.org/system/files/conference/usenixsecurity25/sec25cycle1-prepub-748-smajlovic.pdf"
    ]
  },
  {
    "id": "8/20/2025 14:01:03",
    "mentor": {
      "name": "Claus Horn",
      "organization": "Yale University",
      "bio": "Dr. Horn's research interests lie at the intersection of AI for scientific discovery and AI safety. His past research focused on computational biology and autonomous learning systems with life science applications. He served as director of the AI extension school at ICLS and runs research project in collaboration with Yale and ETH Zurich. As a dedicated educator, he has been teaching over 500 students in deep learning, reinforcement learning, and artificial intelligence since 2019.\nBefore this he pioneered data science in Switzerland and he founded a platform for open education to foster collaboration between academics and professional data scientists. After his Ph.D. he worked at Stanford University and  CERN where he contributed to searches for supersymmetric particles, microscopic black holes, and the Higgs boson, whose discovery was awarded the Nobel Prize in 2013. In his Ph.D. thesis, he pioneered machine learning in particle physics and developed one of the first applications of machine learning at the petabyte scale.",
      "email": "claus.horn@gmail.com",
      "photo": "https://drive.google.com/open?id=1qjQlzov663E48IsKCmtkI04XhlAr2-MF"
    },
    "project": {
      "title": "Robust Scoring of Research Ideas",
      "description": "https://drive.google.com/open?id=1jmIBTYQj0uvBxRkcD1TJME0bk9NhZLxg",
      "researchArea": "AI for Scientific Discovery",
      "prerequisites": "Highly proficient using Python. Experience with LLM agents is a plus.",
      "hoursPerWeek": "10"
    },
    "questions": [
      "Please provide a critique of the following article (1/2 page): https://research.google/blog/accelerating-scientific-breakthroughs-with-an-ai-co-scientist/",
      "Propose an initial experiment to begin researching the questions in the research plan (1/2 page)."
    ]
  }
]